organization id : 63eb84c2-9264-4191-995a-9f2c9d22bbbd

`i created a terraform module with a for loop in order to in the future i will able to create more then 1 cluster if we need:
data.tf
data "singlestoredb_regions" "all" {}
provider.tf
terraform {
  required_providers {
    singlestoredb = {
      source = "singlestore-labs/singlestoredb"
      version = "0.1.0-alpha.3"
    }
  }
}
variables.tf
variable "env" {}
variable "workspace_settings" {}

variable "workspace_group_name" {}
variable "workspace_name" {}
variable "instance_type" {}
variable "suspended" {}
workspace.tf
resource "singlestoredb_workspace" "this" {
  for_each = var.workspace_settings
  name               = each.value.workspace_name
  workspace_group_id = singlestoredb_workspace_group.singlestore[each.key].id
  size               = each.value.instance_type
  suspended          = each.value.suspended

}
workspace_group.tf


resource "singlestoredb_workspace_group" "singlestore" {
  for_each = var.workspace_settings
  name            = each.value.workspace_group_name
  firewall_ranges = ["0.0.0.0/0"] // Ensure restrictive ranges for production environments.
  expires_at      = "2222-01-01T00:00:00Z"
  region_id       = "6be78bc7-5b35-4272-959f-8829b6f8bc63" // Prefer specifying the explicit region ID in production environments as the list of regions may vary.

}
when i call this module i use :
local.tf
locals {
  environment                 = "stg"
  workspace_settings = {
    devops = {
      workspace_name = "devops"
      suspended = false
      instance_type = "S-00"
      workspace_group_name = "devops-group"
    }

  }


}
main.tf
module "singlestore" {
  source         = "../../_internals/singlestore"
  env = local.environment
  instance_type = local.workspace_settings.devops.instance_type
  suspended = local.workspace_settings.devops.suspended
  workspace_group_name = local.workspace_settings.devops.workspace_group_name
  workspace_name = local.workspace_settings.devops.workspace_name
  workspace_settings = local.workspace_settings
}
provider.tf
terraform {
  required_providers {
    singlestoredb = {
      source = "singlestore-labs/singlestoredb"
      version = "0.1.0-alpha.3"
    }
  }
}

provider "singlestoredb" {
  # Configuration options
}
terragrunt.hcl
include {
  path = find_in_parent_folders()
}

terraform_version_constraint  = ">= 1.0.5"
the command that i run :
tg apply :
`Terraform will perform the following actions:

  # module.singlestore.singlestoredb_workspace.this["devops"] will be created
  + resource "singlestoredb_workspace" "this" {
      + created_at         = (known after apply)
      + endpoint           = (known after apply)
      + id                 = (known after apply)
      + name               = "devops"
      + size               = "S-00"
      + suspended          = false
      + workspace_group_id = (known after apply)
    }

  # module.singlestore.singlestoredb_workspace_group.singlestore["devops"] will be created
  + resource "singlestoredb_workspace_group" "singlestore" {
      + admin_password  = (sensitive value)
      + created_at      = (known after apply)
      + expires_at      = "2222-01-01T00:00:00Z"
      + firewall_ranges = [
          + "0.0.0.0/0",
        ]
      + id              = (known after apply)
      + name            = "devops-group"
      + region_id       = "6be78bc7-5b35-4272-959f-8829b6f8bc63"
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value:
when enter yes
module.singlestore.singlestoredb_workspace_group.singlestore["devops"]: Creating...
module.singlestore.singlestoredb_workspace_group.singlestore["devops"]: Still creating... [10s elapsed]
╷
│ Error: SingleStore API client call failed
│
│   with module.singlestore.singlestoredb_workspace_group.singlestore["devops"],
│   on ../../_internals/singlestore/workspace_group.tf line 3, in resource "singlestoredb_workspace_group" "singlestore":
│    3: resource "singlestoredb_workspace_group" "singlestore" {
│
│ An unexpected error occurred when calling SingleStore API. If the error is
│ not clear, please report the issue https://www.singlestore.com/support/.
│
│ SingleStore client error: Post
│ "https://api.singlestore.com/v1/workspaceGroups": POST
│ https://api.singlestore.com/v1/workspaceGroups giving up after 5 attempt(s)`